bogdanm/eLuaBrain/src/platform/stm32/platform.c
u32 platform_adc_setclock( unsigned id, u32 frequency )
{
  TIM_TimeBaseInitTypeDef timer_base_struct;
  elua_adc_dev_state *d = adc_get_dev_state( 0 );
  
  unsigned period, prescaler;
  
  // Make sure sequencer is disabled before making changes
  ADC_ExternalTrigConvCmd( adc[ d->seq_id ], DISABLE );
  
  if ( frequency > 0 )
  {
    d->clocked = 1;
    // Attach timer to converter
    adc_init_struct.ADC_ExternalTrigConv = adc_timer[ d->timer_id ];
    
    period = TIM_GET_BASE_CLK( id ) / frequency;
    
    prescaler = (period / 0x10000) + 1;
    period /= prescaler;

    timer_base_struct.TIM_Period = period - 1;
    timer_base_struct.TIM_Prescaler = prescaler - 1;
    timer_base_struct.TIM_ClockDivision = TIM_CKD_DIV1;
    timer_base_struct.TIM_CounterMode = TIM_CounterMode_Down;
    TIM_TimeBaseInit( timer[ d->timer_id ], &timer_base_struct );
    
    frequency = ( TIM_GET_BASE_CLK( id ) / ( TIM_GetPrescaler( timer[ d->timer_id ] ) + 1 ) ) / period;
    
    // Set up output compare for timer
    TIM_SelectOutputTrigger(timer[ d->timer_id ], TIM_TRGOSource_Update);
  }
  else
  {
    d->clocked = 0;
    
    // Switch to Software-only Trigger
    adc_init_struct.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None;   
  }
  
  // Apply config
  ADC_Init( adc[ d->seq_id ], &adc_init_struct );
  
  return frequency;
}

int platform_adc_start_sequence( )
{ 
  elua_adc_dev_state *d = adc_get_dev_state( 0 );
  
  // Only force update and initiate if we weren't already running
  // changes will get picked up during next interrupt cycle
  if ( d->running != 1 )
  {
    adc_update_dev_sequence( 0 );
    
    d->running = 1;
    
    DMA_ClearITPendingBit( DMA1_IT_TC1 );

    nvic_init_structure_adc.NVIC_IRQChannelCmd = ENABLE; 
    NVIC_Init(&nvic_init_structure_adc);

    if( d->clocked == 1 )
      ADC_ExternalTrigConvCmd( adc[ d->seq_id ], ENABLE );
    else
      ADC_SoftwareStartConvCmd( adc[ d->seq_id ], ENABLE );
  }

  return PLATFORM_OK;
}

#endif // ifdef BUILD_ADC

// ****************************************************************************
// I2C support

static I2C_TypeDef *const i2c[]  = { I2C1, I2C2 };
static const u16 i2c_gpio_pins[] = { GPIO_Pin_6  | GPIO_Pin_7,
                                     GPIO_Pin_10 | GPIO_Pin_11 };
//                                   SCL           SDA

static void i2cs_init()
{
  RCC_APB1PeriphClockCmd( RCC_APB1Periph_I2C1, ENABLE );
  RCC_APB1PeriphClockCmd( RCC_APB1Periph_I2C2, ENABLE );
}

u32 platform_i2c_setup( unsigned id, u32 speed )
{
  I2C_InitTypeDef I2C_InitStructure;
  GPIO_InitTypeDef GPIO_InitStructure;
  
  /* Configure I2C pins */
  GPIO_InitStructure.GPIO_Pin = i2c_gpio_pins[ id ];
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_OD;
  GPIO_Init( GPIOB, &GPIO_InitStructure );

  /* Configure I2C peripheral */
  I2C_Cmd( i2c[ id ], DISABLE );
  I2C_StructInit( &I2C_InitStructure );
  I2C_InitStructure.I2C_Mode = I2C_Mode_I2C;
  I2C_InitStructure.I2C_DutyCycle = I2C_DutyCycle_2;
  I2C_InitStructure.I2C_Ack = I2C_Ack_Enable;
  I2C_InitStructure.I2C_ClockSpeed = speed;
  I2C_InitStructure.I2C_OwnAddress1 = 0; // dummy, shouldn't matter
  I2C_InitStructure.I2C_AcknowledgedAddress = I2C_AcknowledgedAddress_7bit;
  I2C_Init( i2c[ id ], &I2C_InitStructure );
  I2C_Cmd( i2c[ id ], ENABLE );

  return speed;
}

void platform_i2c_send_start( unsigned id )
{
  I2C_TypeDef *pi2c = ( I2C_TypeDef* )i2c[ id ];

  //while( I2C_GetFlagStatus( pi2c, I2C_FLAG_BUSY ) );
  I2C_GenerateSTART( pi2c, ENABLE );
  while( I2C_CheckEvent( pi2c, I2C_EVENT_MASTER_MODE_SELECT ) != SUCCESS );
}

void platform_i2c_send_stop( unsigned id )
{
  I2C_TypeDef *pi2c = ( I2C_TypeDef* )i2c[ id ];

  I2C_GenerateSTOP( pi2c, ENABLE );
  while( I2C_GetFlagStatus( pi2c, I2C_FLAG_BUSY ) );
  ( void )pi2c->SR1;
  ( void )pi2c->SR2;
}

int platform_i2c_send_address( unsigned id, u16 address, int direction )
{
  I2C_TypeDef *pi2c = ( I2C_TypeDef* )i2c[ id ];
  u32 flags;
  u32 match = direction == PLATFORM_I2C_DIRECTION_TRANSMITTER ? I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED : I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED;
  int res = 1;

  I2C_Send7bitAddress( pi2c, address, direction == PLATFORM_I2C_DIRECTION_TRANSMITTER ? I2C_Direction_Transmitter : I2C_Direction_Receiver );
  while( 1 )
  {
    flags = I2C_GetLastEvent( pi2c );
    if( flags & I2C_FLAG_AF )
    {
      I2C_ClearFlag( pi2c, I2C_FLAG_AF );
      res = 0;
      break;
    }
    if( flags == match )
      break;
  }
  ( void )pi2c->SR1;
  ( void )pi2c->SR2;
  return res;
}

int platform_i2c_send_byte( unsigned id, u8 data )
{
  I2C_TypeDef *pi2c = ( I2C_TypeDef* )i2c[ id ];
  u32 flags;
  int res = 1;

  I2C_SendData( pi2c, data ); 
  while( 1 )
  {
    flags = I2C_GetLastEvent( pi2c );
    if( flags & I2C_FLAG_AF )
    {
      I2C_ClearFlag( pi2c, I2C_FLAG_AF );
      res = 0;
      break;
    }
    if( flags == I2C_EVENT_MASTER_BYTE_TRANSMITTED )
      break;
  }
  return res;
}

int platform_i2c_recv_byte( unsigned id, int ack )
{
  I2C_TypeDef *pi2c = ( I2C_TypeDef* )i2c[ id ];
  u8 data;

  I2C_AcknowledgeConfig( pi2c, ack ? ENABLE : DISABLE );
  if( !ack )
    I2C_GenerateSTOP( pi2c, ENABLE );
  while( I2C_GetFlagStatus( pi2c, I2C_FLAG_RXNE ) == RESET );
  data = I2C_ReceiveData( pi2c );
  if( !ack )
    while( pi2c->CR1 & I2C_CR1_STOP );
  return data;
}

// *****************************************************************************
// VRAM subsystem

extern u32 vram_data[ VRAM_SIZE_TOTAL >> 2 ]; 

#define SPI2_DR_Address       0x4000380C
#define SPI_VRAM_PIN_MOSI     GPIO_Pin_15
#define SPI_VRAM_PIN_MISO     GPIO_Pin_14
#define SPI_VRAM_PIN_CLK      GPIO_Pin_13
#define SPI_VRAM_PORT         GPIOB
#define SPI_VRAM_PERIPH       SPI2
#define PROP_RESET_PIN        12
#define PROP_RESET_PORT       1

static void vram_transfer_init()
{
  // NEW CODE
  DMA_InitTypeDef DMA_InitStructure;
  SPI_InitTypeDef SPI_InitStructure;
  GPIO_InitTypeDef GPIO_InitStructure;

  // Setup SPI interface in slave mode
   /* Configure SPI pins */
  GPIO_InitStructure.GPIO_Pin = SPI_VRAM_PIN_CLK | SPI_VRAM_PIN_MOSI;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
  GPIO_Init(SPI_VRAM_PORT, &GPIO_InitStructure);
  GPIO_InitStructure.GPIO_Pin = SPI_VRAM_PIN_MISO;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
  GPIO_Init(SPI_VRAM_PORT, &GPIO_InitStructure);
 
  /* Take down, then reconfigure SPI peripheral */
  SPI_Cmd( SPI_VRAM_PERIPH, DISABLE );
  SPI_InitStructure.SPI_Direction = SPI_Direction_2Lines_FullDuplex;
  SPI_InitStructure.SPI_Mode = SPI_Mode_Slave;
  SPI_InitStructure.SPI_DataSize = SPI_DataSize_8b;
  SPI_InitStructure.SPI_CPOL = SPI_CPOL_Low;
  SPI_InitStructure.SPI_CPHA = SPI_CPHA_1Edge;
  SPI_InitStructure.SPI_NSS = SPI_NSS_Soft;
  SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_2;
  SPI_InitStructure.SPI_FirstBit = SPI_FirstBit_MSB;
  SPI_InitStructure.SPI_CRCPolynomial = 7;
  SPI_Init( SPI_VRAM_PERIPH, &SPI_InitStructure );
  SPI_Cmd( SPI_VRAM_PERIPH, ENABLE );
  SPI_NSSInternalSoftwareConfig( SPI_VRAM_PERIPH, SPI_NSSInternalSoft_Reset );
  
  // Setup DMA
  RCC_AHBPeriphClockCmd( RCC_AHBPeriph_DMA1, ENABLE );  
  DMA_DeInit( DMA1_Channel5 );
  DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)SPI2_DR_Address;
  DMA_InitStructure.DMA_MemoryBaseAddr = (uint32_t)vram_data;
  DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralDST;
  DMA_InitStructure.DMA_Priority = DMA_Priority_VeryHigh;
  DMA_InitStructure.DMA_BufferSize = VRAM_SIZE_TOTAL;
  DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
  DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
  DMA_InitStructure.DMA_PeripheralDataSize = DMA_MemoryDataSize_Byte;
  DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
  DMA_InitStructure.DMA_Mode = DMA_Mode_Circular;
  DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;
  DMA_Init( DMA1_Channel5, &DMA_InitStructure );     
  
  // Start DMA transfer now
  // It will automatically cycle through the data each time a request is made
	SPI_I2S_DMACmd( SPI_VRAM_PERIPH, SPI_I2S_DMAReq_Tx, ENABLE );	
	DMA_Cmd( DMA1_Channel5, ENABLE );  

  // Now it's a good time to get the Propeller out of reset
  platform_pio_op( PROP_RESET_PORT, 1 << PROP_RESET_PIN, PLATFORM_IO_PIN_SET );  
  platform_pio_op( PROP_RESET_PORT, 1 << PROP_RESET_PIN, PLATFORM_IO_PIN_DIR_OUTPUT );
}

// ****************************************************************************
// Ethernet support with ENC28J60

#ifdef BUILD_ENC28J60

#define ETH_INT_RESNUM        PLATFORM_IO_ENCODE( ENC28J60_INT_PORT, ENC28J60_INT_PIN, PLATFORM_IO_ENC_PIN )
#define MAX_SEND_RETRY        5

static u8 forced;

