bogdanm/eLuaBrain/src/platform/stm32/platform.c
// Ethernet interrupt handler
void eth_int_handler()
{
  if( !forced )
    platform_s_uart_send( 0, '@' );
  forced = 0;
  if( eth_initialized )
  {
    SetRXInterrupt( 0 );
    elua_uip_mainloop();
    SetRXInterrupt( 1 );
  }
}

static void eth_init()
{
  static struct uip_eth_addr sTempAddr;
  unsigned i;

  // [REMOVE]
  platform_uart_setup( 0, 115200, 8, PLATFORM_UART_PARITY_NONE, PLATFORM_UART_STOPBITS_1 );
  
  // Initialize the MAC first
  static const u8 macaddr[] = ENC28J60_MAC_ADDRESS;
  initMAC( macaddr );

  // Setup Ethernet timer
  platform_s_timer_op( ELUA_DHCP_TIMER_ID, PLATFORM_TIMER_OP_SET_CLOCK, 1200 );

  // Then the Ethernet interrupt
  platform_pio_op( ENC28J60_INT_PORT, 1 << ENC28J60_INT_PIN, PLATFORM_IO_PIN_DIR_INPUT );
  platform_pio_op( ENC28J60_INT_PORT, 1 << ENC28J60_INT_PIN, PLATFORM_IO_PIN_PULLUP );
  platform_cpu_set_interrupt( INT_GPIO_NEGEDGE, ETH_INT_RESNUM, PLATFORM_CPU_ENABLE );
  // Note: the handler will be called automatically from platform_int.c
  SetRXInterrupt( 1 );
 
  // Let uIP run now
  for( i = 0; i < 6; i ++ )
    sTempAddr.addr[ i ] = macaddr[ i ];
  elua_uip_init( &sTempAddr );
  eth_initialized = 1;    
}

void platform_eth_send_packet( const void* src, u32 size )
{
  int retrcount = 0;
  //printf( "send %d bytes\n", ( int )size );
  //for( retrcount = 0; retrcount < MAX_SEND_RETRY; retrcount ++ )
  //  if( MACWrite( ( u8* )src, ( u16 )size ) == TRUE )
  //    return;
  MACWrite( ( u8* )src, ( u16 )size );
}

u32 platform_eth_get_packet_nb( void* buf, u32 maxlen )
{
  u16 res = MACRead( buf, maxlen );
//  if( res > 0 )
//    printf( "got %d bytes\n", res );
  return res;
}

void platform_eth_force_interrupt()
{
  forced = 1;
  EXTI_GenerateSWInterrupt( exti_line[ ENC28J60_INT_PIN ]  ); 
}

u32 platform_eth_get_elapsed_time()
{
  if( eth_timer_fired )
  {
    eth_timer_fired = 0;
    return SYSTICK_ETH_LIMIT_MS;
  }
  else
    return 0;
}

void platform_eth_set_interrupt( int state )
{
  platform_cpu_set_interrupt( INT_GPIO_NEGEDGE, ETH_INT_RESNUM, state == PLATFORM_ETH_INT_ENABLE ? PLATFORM_CPU_ENABLE : PLATFORM_CPU_DISABLE );
}

#else // #ifdef BUILD_ENC28J60

static void eth_init()
{
}

#endif // #ifdef BUILD_ENC28J60

// ****************************************************************************
// Platform specific modules go here

#define MIN_OPT_LEVEL 2
#include "lrodefs.h"
extern const LUA_REG_TYPE enc_map[];
extern const LUA_REG_TYPE snd_map[];

const LUA_REG_TYPE platform_map[] =
{
#if LUA_OPTIMIZE_MEMORY > 0
  { LSTRKEY( "enc" ), LROVAL( enc_map ) },
  { LSTRKEY( "snd" ), LROVAL( snd_map ) },
#endif
  { LNILKEY, LNILVAL }
};

LUALIB_API int luaopen_platform( lua_State *L )
{
#if LUA_OPTIMIZE_MEMORY > 0
  return 0;
#else // #if LUA_OPTIMIZE_MEMORY > 0
  luaL_register( L, PS_LIB_TABLE_NAME, platform_map );

  // Setup the new tables inside platform table
  lua_newtable( L );
  luaL_register( L, NULL, enc_map );
  lua_setfield( L, -2, "enc" );

  return 1;
#endif // #if LUA_OPTIMIZE_MEMORY > 0
}

